v2206/MSc_icedAirfoil/_legacy/+10deg/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.8438;

boundaryField
{
    airfoil
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    west
    {
        type            fixedValue;
        value           $internalField;
    }
    east
    {
	type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    north
    {
	type		slip;
    }
    south
    {
	type		slip;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}
// ************************************************************************* //
