v2206/MSc_icedAirfoil/_legacy/+10deg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(-1.2	-1	-0.1)	// vertex 0
	(-1.2	1	-0.1)	// vertex 1
	(3	-1	-0.1)	// vertex 2
	(3	1	-0.1)	// vertex 3
	(-1.2	-1	0.1)	// vertex 4
	(-1.2	1	0.1)	// vertex 5
	(3	-1	0.1)	// vertex 6
	(3	1	0.1)	// vertex 7
);


blocks
(
    hex (0 2 3 1 4 6 7 5)
    (48 24 1)
    simpleGrading (1 1 1)
);


edges
(
);

boundary
(
    west
    {
        type patch;
        faces
        (
		(0 1 5 4)
        );
    }
    east
    {
        type patch;
        faces
        (
		(2 6 7 3)
        );
    }
    north
    {
        type patch;
        faces
        (
		(1 3 7 5)
	);
    }
    south
    {
        type patch;
        faces
        (
		(0 4 6 2)
        );
    }
    front
    {
        type empty;
        faces
        (
		(4 6 7 5)
        );
    }
    back
    {
        type empty;
        faces
        (
		(0 2 3 1)
        );
    }
);

// ************************************************************************* //
